app/controllers/static_pages_controller.rb

  def home
  	@users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"